function popupFeedback() {
    const feedbackBtn = document.querySelector(".popupbtn");
    const overlay = document.querySelector(".overlay")
    const bodyInser = document.querySelector("body");
    const closeBtn = document.querySelectorAll(".feedback__leave-close")
    
    const createELModal = document.createElement("div");
    createELModal.classList.add("feedback__leave")
    const template = `
    <div class="feedback__leave-close"> <img class="close-img" src="/assets/images/close.svg" alt=""/></div>
    <div class="feedback__leave-content"> 
      <div class="content__title-f">Мой отзыв</div>
      <div class="content__get">
        <label class="get__input">
          <div class="input__text">Представьтесь</div>
          <input class="get__form" type="text" placeholder="Ваше имя">
        </label>
        <label class="get__input">
          <div class="input__text">Текст отзыва</div>
          <textarea class="get__textarea" cols="30" rows="10" placeholder="Писать сюда :)"> </textarea>
        </label>
        <label class="get__input-file" for="get__file">
          <div class="get__input-icon"> <img src="/assets/images/photoformmodal.svg" alt=""></div>
          <div class="get__input-text"></div>
          <div class="get__input-title">Не забудьте добавить фото</div>
          <div class="get__input-formats">.jpg, .jpeg, .png менее 10 МБ    </div>
          <input class="get__file" id="get__file" type="file" multiple="multiple">
        </label>
      </div>
      <div class="content__estimation"> 
        <div class="content__estimation-title"> Оценка</div>
        <div class="content__estimation-stars"> 
          <ul class="stars__list"> 
            <li class="stars__list-item">
               <svg class="star" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
<g clip-path="url(#clip0_1_1253)">
<path d="M16.2358 6.96709L16.3494 7.16832L16.5763 7.21215L22.6897 8.39315C23.0476 8.46231 23.3396 8.72077 23.4516 9.06757L23.4516 9.06769C23.5637 9.41453 23.4781 9.79488 23.2282 10.0603L23.2282 10.0604L18.7904 14.7755L18.6226 14.9538L18.6606 15.1957L19.7821 22.3449C19.7821 22.3449 19.7821 22.345 19.7821 22.345C19.8397 22.7125 19.6886 23.0816 19.39 23.303L19.3899 23.3031C19.0913 23.5246 18.6943 23.5622 18.3592 23.4005C18.3592 23.4005 18.3591 23.4005 18.3591 23.4005L12.2175 20.4343L12 20.3292L11.7826 20.4343L5.64086 23.4005C5.64084 23.4005 5.64082 23.4005 5.6408 23.4005C5.30587 23.5622 4.90885 23.5247 4.61014 23.3031L4.61005 23.303C4.31145 23.0816 4.16034 22.7126 4.218 22.345L5.33947 15.1957L5.37741 14.9538L5.20961 14.7755L0.771834 10.0604L0.771827 10.0604C0.521991 9.79491 0.436393 9.41452 0.548442 9.06763L0.0726483 8.91394L0.548444 9.06763C0.660491 8.72074 0.952426 8.4623 1.31036 8.39315C1.31036 8.39315 1.31036 8.39315 1.31037 8.39315L7.42376 7.21215L7.65067 7.16832L7.7643 6.96709L11.1293 1.00828C11.3066 0.694222 11.6394 0.5 12 0.5C12.3607 0.5 12.6934 0.694218 12.8708 1.00829L16.2358 6.96709Z" stroke="#878B90"/>
</g>
<defs>
<clipPath id="clip0_1_1253">
<rect width="24" height="24" fill="white"/>
</clipPath>
</defs>
</svg>
            </li>
            <li class="stars__list-item">
               <svg class="star" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
<g clip-path="url(#clip0_1_1253)">
<path d="M16.2358 6.96709L16.3494 7.16832L16.5763 7.21215L22.6897 8.39315C23.0476 8.46231 23.3396 8.72077 23.4516 9.06757L23.4516 9.06769C23.5637 9.41453 23.4781 9.79488 23.2282 10.0603L23.2282 10.0604L18.7904 14.7755L18.6226 14.9538L18.6606 15.1957L19.7821 22.3449C19.7821 22.3449 19.7821 22.345 19.7821 22.345C19.8397 22.7125 19.6886 23.0816 19.39 23.303L19.3899 23.3031C19.0913 23.5246 18.6943 23.5622 18.3592 23.4005C18.3592 23.4005 18.3591 23.4005 18.3591 23.4005L12.2175 20.4343L12 20.3292L11.7826 20.4343L5.64086 23.4005C5.64084 23.4005 5.64082 23.4005 5.6408 23.4005C5.30587 23.5622 4.90885 23.5247 4.61014 23.3031L4.61005 23.303C4.31145 23.0816 4.16034 22.7126 4.218 22.345L5.33947 15.1957L5.37741 14.9538L5.20961 14.7755L0.771834 10.0604L0.771827 10.0604C0.521991 9.79491 0.436393 9.41452 0.548442 9.06763L0.0726483 8.91394L0.548444 9.06763C0.660491 8.72074 0.952426 8.4623 1.31036 8.39315C1.31036 8.39315 1.31036 8.39315 1.31037 8.39315L7.42376 7.21215L7.65067 7.16832L7.7643 6.96709L11.1293 1.00828C11.3066 0.694222 11.6394 0.5 12 0.5C12.3607 0.5 12.6934 0.694218 12.8708 1.00829L16.2358 6.96709Z" stroke="#878B90"/>
</g>
<defs>
<clipPath id="clip0_1_1253">
<rect width="24" height="24" fill="white"/>
</clipPath>
</defs>
</svg>
            </li>
            <li class="stars__list-item">
               <svg class="star" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
<g clip-path="url(#clip0_1_1253)">
<path d="M16.2358 6.96709L16.3494 7.16832L16.5763 7.21215L22.6897 8.39315C23.0476 8.46231 23.3396 8.72077 23.4516 9.06757L23.4516 9.06769C23.5637 9.41453 23.4781 9.79488 23.2282 10.0603L23.2282 10.0604L18.7904 14.7755L18.6226 14.9538L18.6606 15.1957L19.7821 22.3449C19.7821 22.3449 19.7821 22.345 19.7821 22.345C19.8397 22.7125 19.6886 23.0816 19.39 23.303L19.3899 23.3031C19.0913 23.5246 18.6943 23.5622 18.3592 23.4005C18.3592 23.4005 18.3591 23.4005 18.3591 23.4005L12.2175 20.4343L12 20.3292L11.7826 20.4343L5.64086 23.4005C5.64084 23.4005 5.64082 23.4005 5.6408 23.4005C5.30587 23.5622 4.90885 23.5247 4.61014 23.3031L4.61005 23.303C4.31145 23.0816 4.16034 22.7126 4.218 22.345L5.33947 15.1957L5.37741 14.9538L5.20961 14.7755L0.771834 10.0604L0.771827 10.0604C0.521991 9.79491 0.436393 9.41452 0.548442 9.06763L0.0726483 8.91394L0.548444 9.06763C0.660491 8.72074 0.952426 8.4623 1.31036 8.39315C1.31036 8.39315 1.31036 8.39315 1.31037 8.39315L7.42376 7.21215L7.65067 7.16832L7.7643 6.96709L11.1293 1.00828C11.3066 0.694222 11.6394 0.5 12 0.5C12.3607 0.5 12.6934 0.694218 12.8708 1.00829L16.2358 6.96709Z" stroke="#878B90"/>
</g>
<defs>
<clipPath id="clip0_1_1253">
<rect width="24" height="24" fill="white"/>
</clipPath>
</defs>
</svg>
            </li>
            <li class="stars__list-item">
               <svg class="star" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
<g clip-path="url(#clip0_1_1253)">
<path d="M16.2358 6.96709L16.3494 7.16832L16.5763 7.21215L22.6897 8.39315C23.0476 8.46231 23.3396 8.72077 23.4516 9.06757L23.4516 9.06769C23.5637 9.41453 23.4781 9.79488 23.2282 10.0603L23.2282 10.0604L18.7904 14.7755L18.6226 14.9538L18.6606 15.1957L19.7821 22.3449C19.7821 22.3449 19.7821 22.345 19.7821 22.345C19.8397 22.7125 19.6886 23.0816 19.39 23.303L19.3899 23.3031C19.0913 23.5246 18.6943 23.5622 18.3592 23.4005C18.3592 23.4005 18.3591 23.4005 18.3591 23.4005L12.2175 20.4343L12 20.3292L11.7826 20.4343L5.64086 23.4005C5.64084 23.4005 5.64082 23.4005 5.6408 23.4005C5.30587 23.5622 4.90885 23.5247 4.61014 23.3031L4.61005 23.303C4.31145 23.0816 4.16034 22.7126 4.218 22.345L5.33947 15.1957L5.37741 14.9538L5.20961 14.7755L0.771834 10.0604L0.771827 10.0604C0.521991 9.79491 0.436393 9.41452 0.548442 9.06763L0.0726483 8.91394L0.548444 9.06763C0.660491 8.72074 0.952426 8.4623 1.31036 8.39315C1.31036 8.39315 1.31036 8.39315 1.31037 8.39315L7.42376 7.21215L7.65067 7.16832L7.7643 6.96709L11.1293 1.00828C11.3066 0.694222 11.6394 0.5 12 0.5C12.3607 0.5 12.6934 0.694218 12.8708 1.00829L16.2358 6.96709Z" stroke="#878B90"/>
</g>
<defs>
<clipPath id="clip0_1_1253">
<rect width="24" height="24" fill="white"/>
</clipPath>
</defs>
</svg>
            </li>
            <li class="stars__list-item">
               <svg class="star" xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
<g clip-path="url(#clip0_1_1253)">
<path d="M16.2358 6.96709L16.3494 7.16832L16.5763 7.21215L22.6897 8.39315C23.0476 8.46231 23.3396 8.72077 23.4516 9.06757L23.4516 9.06769C23.5637 9.41453 23.4781 9.79488 23.2282 10.0603L23.2282 10.0604L18.7904 14.7755L18.6226 14.9538L18.6606 15.1957L19.7821 22.3449C19.7821 22.3449 19.7821 22.345 19.7821 22.345C19.8397 22.7125 19.6886 23.0816 19.39 23.303L19.3899 23.3031C19.0913 23.5246 18.6943 23.5622 18.3592 23.4005C18.3592 23.4005 18.3591 23.4005 18.3591 23.4005L12.2175 20.4343L12 20.3292L11.7826 20.4343L5.64086 23.4005C5.64084 23.4005 5.64082 23.4005 5.6408 23.4005C5.30587 23.5622 4.90885 23.5247 4.61014 23.3031L4.61005 23.303C4.31145 23.0816 4.16034 22.7126 4.218 22.345L5.33947 15.1957L5.37741 14.9538L5.20961 14.7755L0.771834 10.0604L0.771827 10.0604C0.521991 9.79491 0.436393 9.41452 0.548442 9.06763L0.0726483 8.91394L0.548444 9.06763C0.660491 8.72074 0.952426 8.4623 1.31036 8.39315C1.31036 8.39315 1.31036 8.39315 1.31037 8.39315L7.42376 7.21215L7.65067 7.16832L7.7643 6.96709L11.1293 1.00828C11.3066 0.694222 11.6394 0.5 12 0.5C12.3607 0.5 12.6934 0.694218 12.8708 1.00829L16.2358 6.96709Z" stroke="#878B90"/>
</g>
<defs>
<clipPath id="clip0_1_1253">
<rect width="24" height="24" fill="white"/>
</clipPath>
</defs>
</svg>
            </li>
          </ul>
        </div>
      </div>
      <div class="content__button-mod"> 
        <div class="content__button-btn-mod" id="leavefeedback">Оставить отзыв</div>
      </div>
    </div>
  </div>
        `

    feedbackBtn.addEventListener("click", (e) => {
        bodyInser.append(createELModal)
        createELModal.innerHTML = template;
        createELModal.style.top = `${scrollToUp - scrollToUp + 20}px`
        createELModal.classList.toggle("feedback__leave--active")
        overlay.style.top = `${scrollToUp}px`
        overlay.classList.toggle("overlay--active")
        bodyInser.classList.toggle("no-scroll")
                

        if(createELModal.classList.contains("feedback__leave--active")) {
            overlayButtonCloseModal(bodyInser, createELModal, "feedback__leave--active")

            closeModal(bodyInser, overlay, createELModal, "feedback__leave--active")
        }
    })
    
}

popupFeedback()